# Lecture 36

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'city':['Alma','Brian Head','Fox Park'],
                   'altitude':[3158,3000,2762]})
dframe

   altitude        city
0      3158        Alma
1      3000  Brian Head
2      2762    Fox Park

## Adding a new column

In [6]:
state_map = {'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming'}

### creating a new column 'state', calling map onto the 'city' column

In [8]:
dframe['state'] = dframe['city'].map(state_map)

In [9]:
dframe

   altitude        city     state
0      3158        Alma  Colorado
1      3000  Brian Head      Utah
2      2762    Fox Park   Wyoming

# Lecture 37 - Replace

In [10]:
ser1 = Series([1,2,3,4,1,2,3,4])
ser1

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [11]:
ser1.replace(1,np.nan)

0   NaN
1     2
2     3
3     4
4   NaN
5     2
6     3
7     4
dtype: float64

In [12]:
ser1.replace([1,4],[100,400])

0    100
1      2
2      3
3    400
4    100
5      2
6      3
7    400
dtype: int64

In [13]:
ser1.replace({4:np.nan})

0     1
1     2
2     3
3   NaN
4     1
5     2
6     3
7   NaN
dtype: float64

# Lecture 38 - Rename Index

In [35]:
dframe = DataFrame(np.arange(12).reshape(3,4),
                  index = ['NY','LA','SF'],
                  columns = ['A','B','C','D'])
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

## extract index and change it to lower case

In [36]:
dframe.index.map(str.lower)

array(['ny', 'la', 'sf'], dtype=object)

In [37]:
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

## extract index and change it to lower case permanently

In [38]:
dframe.index = dframe.index.map(str.lower)

In [39]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

## str.title makes the first letter upper case
* NOT permanent

In [40]:
dframe.rename(index = str.title,
             columns = str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

## str.upper makes all letter upper case
* NOT permanent

In [41]:
dframe.rename(index = str.upper,
             columns = str.lower)

    a  b   c   d
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

### NOT permanent

In [42]:
dframe.rename(index = {'ny':'NEW YORK'},
             columns = {'A':'ALPHA'})

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [44]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

## this change is PERMANENT

In [46]:
dframe.rename(index = {'ny':'NEW YORK'},inplace = True)

In [47]:
dframe

          A  B   C   D
NEW YORK  0  1   2   3
la        4  5   6   7
sf        8  9  10  11

## this change is PERMANENT

In [48]:
dframe.rename(index = str.upper,inplace = True)

In [49]:
dframe

          A  B   C   D
NEW YORK  0  1   2   3
LA        4  5   6   7
SF        8  9  10  11